{
 "projects":[
  { "name": "Sublime Ordinary: Visualizing an Archive of Soundscapes",
  "subtitle":"Presented on 7th Workshop on Visualization for Communication, IEEE VIS 2025 & NEURIPS Creative AI Track 2025",
  "type":["Data Visualization", "Full-Stack", "Machine Learning", "Exhibition"],
  "tags": ["Multi-modal Visualization", "Accessibility", "Urban Computing" ],
  "description": "The Sublime Ordinary is a web-based audiovisual interface that uses sound as a medium for communicating temporal urban change to the public. Drawing from an archive of recordings captured in Harvard Square during the COVID-19 pandemic, the project com- bines geospatial and time-based visualizations with AI-labeled au- dio to explore a new way of communicating the impacts of urban policy through the coupling of visual and auditory cues.",
  "video":"/assets/video/Neurips_Final_Revision_compressed.mp4",
  "year":"2025",
  "team": [" Elina Oikonomaki (Data Visualization Researcher, Full-stack Developer & Designer)", " Lukas Lesina Debiasi (Backend & Data Engineer, Designer)"],
  "hasVideo": true,
  "blogItems": [
    {"imgUrl": "/assets/sublime_ordinary/page_1_c.png"}, 
    {"imgUrl": "/assets/sublime_ordinary/page_1_2_c.png"},
    {"imgUrl": "/assets/sublime_ordinary/page_2_c.png"},  
    {"imgUrl": "/assets/sublime_ordinary/page_3_c.png"},
    {"imgUrl": "/assets/sublime_ordinary/page_4_c.png"}
    ]
  },
  { "name": "Travel Itinerary Metrics Visualizer",
  "subtitle":"A visualization tool for exploring different metrics and comparing algorithmic solutions of Mobi's AI Agent",
  "type":["Data Visualization", "Full-Stack", "Machine Learning"],
  "tags": ["Itinerary Visualization"],
  "description": "Travel Itinerary Metrics Visualizer is an interactive visualization tool designed to explore and compare different metrics and algorithmic solutions generated by Mobi’s AI Agent. Originally developed for algorithm engineers, the tool supports the creation and evaluation of new metrics for assessing itinerary quality. Users can animate and compare multiple itinerary solutions side by side within a timeline view, dynamically zooming in and out to examine trip structures at various temporal scales—from high-level overviews to detailed activity sequence.",
  "video":"/assets/video/itinerary_viz_demo_compressed.mp4",
  "year":"2025",
  "team": ["Mobi.AI R&D Team:", " Elina Oikonomaki (Data Visualization Research Engineer, Full-stack Developer & Designer)", " Simon Fang (R&D Team Lead, Staff Research Scientist)", " Peng Yu (CTO)", " Brian Williams (Chief Research Scientist & MIT Professor at CSAIL)"],
  "hasVideo": true,
  "blogItems": [
    {"imgUrl": "/assets/itinerary_viz/itinerary_viz_01.png"}, 
    {"imgUrl": "/assets/itinerary_viz/itinerary_viz_02.png"},
    {"imgUrl": "/assets/itinerary_viz/itinerary_viz_03.png"},  
    {"imgUrl": "/assets/itinerary_viz/itinerary_viz_04.png"},
    {"imgUrl": "/assets/itinerary_viz/itinerary_viz_05.png"},
    {"imgUrl": "/assets/itinerary_viz/itinerary_viz_06.png"},
    {"imgUrl": "/assets/itinerary_viz/itinerary_viz_07.png"}
    ]
  },
  { "name": "H3Xplorer",
  "subtitle":"Reducing Visual Complexity in Multivariate Geographic Data Using Sentence Embedding Clustering.",
  "type":["Data Visualization", "Full-Stack", "Machine Learning"],
  "tags": ["Multivariate Visualization","High-dimensional data", "Interface"],
  "description": "Visualizing high-dimensional geographic data with associated unstructured textual and quantitative attributes, such as Points of Interest (POIs), is challenging. Through a formative user survey and collaborative sessions with data scientists and engineers, we identified key challenges in the analytical and exploratory tasks of such datasets, including the detection of patterns and outliers at a global scale and the characterization of distribution and correlation across regions. To address these challenges, this paper introduces a system that integrates dynamic clustering of sentence embedding vectors with hierarchical H3 binning to reduce visual complexity and enable effective data exploration and analysis. Unstructured text tags are transformed into sentence vector embeddings using GPT-3 and BERT language models to dynamically generate meaningful clusters for effective color encodings. We employ established techniques of color weaving and color blending to generate multivariate geographic visualizations and compare the results. Additionally, to support the exploration and characterization of distributions, the interface integrates a tag-query input, a table view, a barplot view, and a level of detail (LOD) for a granular view of H3 bins. We evaluated the interface through a preliminary study highlighting its potential for supporting analytical and exploratory tasks in multivariate visualizations. Our findings demonstrate the systems' efficiency and scalability for real-time visualization applications using high-dimensional geographic data with unstructured textual and quantitative attributes.",
  "img":"/assets/mobi_clippy/overview.jpg",
  "year":"2024",
  "team": ["Mobi.AI R&D Team:"," Elina Oikonomaki (Data Visualization Research Engineer, Full-stack development & Design)", " Simon Fang (R&D Team Lead, Staff Research Scientist)", " Peng Yu (CTO)"],
  "hasVideo": false,
  "blogItems": [
    {"imgUrl": "/assets/mobi_clippy/initial_screen.jpg"}, 
    {"imgUrl": "/assets/mobi_clippy/overview.jpg"},
    {"imgUrl": "/assets/mobi_clippy/data_sample.jpg"},  
    {"imgUrl": "/assets/mobi_clippy/clustering.jpg"},
    {"imgUrl": "/assets/mobi_clippy/h3.jpg"},
    {"imgUrl": "/assets/mobi_clippy/small_multiples.jpg"}
    ]
  },
  { "name": "Exploring Data Visually",
  "subtitle":"Sketching Visualizations for Diverse Audiences",
  "type":["Teaching", "Workshop"],
  "tags": ["Information Design","Data Visualization", "Sketching"],
  "description": "I was invited to teach a workshop on Exploratory Visual Analysis in the Information Design Studio I, which is a studio required for first-year master's student in the Information Design and Data Visualization program at Northeastern University. The workshop consisted of two parts to sequentially build on skills developed and practiced from the first to the last session. The workshop focused on the creative, iterative process of visual data exploration, emphasizing the reasoning behind design decisions and the role of the audience in this process. These skills are integral to the data visualization practice but are often overlooked in favor of creating polished designs. As an outcome, students practiced skills in creative critical thinking, tailored their designs to target audiences, and learned to conduct research through visual exploration.",
  "img":"/assets/teaching/workshop_main.jpg",
  "year":"2024",
  "hasVideo": false,
  "blogItems": [
    { "markdownFile": "/assets/teaching/workshop.md" },
    {"imgUrl":"/assets/teaching/workshop1.jpg"}
    ]
  },
  
  { "name": "Travel Allocation of Multiple Student Groups in Paris",
        "subtitle":"A prototype interface for visualizing how Mobi's algorithm builds itineraries for groups of students in Paris.",
        "type":[ "Data Visualization"],
        "tags": ["React","WebGL","Typescript","Mapbox"],
        "description": "An interactive visualization prototype that visualizes how our constraint programming algorithm can allocate and distribute student groups across multiple days in Paris. The design shows the different scenarios, how Mobi's algorithm meets the constraints and the itineraries along a week travel.",
        "video":"/assets/video/ef-viz.mp4",
        "img":"/assets/img/ef-viz.jpg",
        "bwImg":"/assets/img/ef-viz_bw.jpg",
        "year":"2024",
        "hasVideo": true
      },
    
    { "name": "Multimodal Learning",
      "subtitle":"Project in Deep Learning Seminar",
      "type":["Data Visualization","Machine Learning"],
      "tags": ["Javascript","Python", "Tensorflow"],
      "description": "This project was developed as part of my final project for the Fall 2021 Deep Learning class that I took at MIT. I developed an interactive data visualization for A.Owens and A.Efros(2018) paper on audio-visual scene analysis. I experimented and tested their model on different inputs from the Google AudioSet and produced a blog to bring new insight and help explain the proposed machine learning model.",
      "video":"/assets/video/multimodal_learning.m4v",
      "img":"/assets/img/ml2.jpg",
      "bwImg":"/assets/img/ml2_bw.jpg",
      "year":"2021",
      "hasVideo": true
    },
   
    { "name": "Urban Transformations in Istanbul : The Fener-Balat Grammar",
    "subtitle":"Diploma Thesis | National Technical University of Athens",
    "type":["Computational Design"],
    "tags": ["Shape grammars","Python", "Grasshopper 3D","Cartography"],
    "description": "The suburbs Fener and Balat in Istanbul, Turkey are part of the greater metropolitan district of the city. Since 1887, Fener and Balat have gone through a series of dynamic urban transformations not resulting from methodical planning. ",
    "img":"/assets/istanbul_thesis/p0.jpg",
    "year":"2018",
    "hasVideo": false,
    "blogItems": [
      {"imgUrl": "/assets/istanbul_thesis/p1.jpg"}, 
      {"imgUrl": "/assets/istanbul_thesis/p2.jpg"},
      {"imgUrl": "/assets/istanbul_thesis/p3.jpg"}, 
      {"imgUrl": "/assets/istanbul_thesis/p4.jpg"}, 
      {"imgUrl": "/assets/istanbul_thesis/p5.jpg"}, 
      {"imgUrl": "/assets/istanbul_thesis/p6.jpg"},
      {"imgUrl": "/assets/istanbul_thesis/p7.jpg"},
      {"imgUrl": "/assets/istanbul_thesis/p8.jpg"},
      {"imgUrl": "/assets/istanbul_thesis/p9.jpg"},
      {"imgUrl": "/assets/istanbul_thesis/p10.jpg"},
      {"imgUrl": "/assets/istanbul_thesis/p11.jpg"}
      ]
    },
    { "name": "School of Unknownables",
    "subtitle":"Istanbul Design Biennal",
    "type":["Exhibition", "Workshop"],
    "tags": ["Exhibition","Art & Design", "Mapping"],
    "team": ["Alpcan Hastürk", " Arda Koray", " Aslıhan Şenel", " Aylin Vartanyan", " Ayşe Şirin Çakmakçı",
    " Beste Soybilge", " Buse Özçelik", " Cemil Çalkıcı",
    " Charlotte Gambotti", " Derya Uzal", "Eda Hisarlıoğlu",
    " Elif Hant", " Elif Tepekaya", " Elina Oikonomaki",
    " Hilal Bozkurt", " Hilal Menlioğlu", " İlknur Özer", " İpek Avanoğlu", " Joseph Morriseau", " Karolina Theleriti"," Metehan Gürsu", " Nida Ekenel", " Seçil Yatan", " Susan Dunne", " Taylan Karabaş", " Tildem Kırtak", " Yağmur Çil", " Zeynep Çabuk"],
    "description": "How do you know a place? What do you know of a place and through whom? What remains unknown? How does knowing and unknowing practices relate to owning, caring about, and sharing place? Our A School of Schools investigates what it means to ‘know’ a place, both as an individual and collectively, as a ‘professional’ and a ‘non-professional’, as an educator and a learner, and explores alternative educational practices in order to question the existing power structures, and sets out to stimulate more egalitarian relationships amongst the different agents of a place. Knowledge is often instrumentalized as a hegemonic device and suggests hierarchies between things like important and secondary, and consequently frames what is to be considered central and marginal. Our school aims to reframe the dominant knowledge of a place as one of the multiple knowledges of that place. We question the ‘well-known’ history and facts of a place and start by un-knowing and un-fixing the established information about a place and search for the lesser- known stories and experiences, that may be subtle or marginal, and most importantly we seek to acknowledge the unrevealed layers of ‘other knowledges’. It is about accepting our own social positions and the limits of our knowledge and facing the fact that we can only ascertain certain things about a place and that the major part will always remain unknowable. Today, more and more, we are faced with highly institutionalized educational environments, where educators and learners are assessed by quantitative rather than qualitative criteria. This kind of approach results in more isolated educational practices in design schools, which lose touch with the socio-cultural context. Extensive production over a short period of time is required by the new world order, mass production and consumption cycles rule. As a consequence, designers in practice and education alike are detached from the site, the users and the inhabitants; merely superficial authoritative knowledge is believed to be sufficient when deciding about the future of a place. The school of unknowables aims to step back from the all-knowing stance, and rather develop sensitive and multiple relationships with place, inhabitants and stories, weaving fine threads across the subtle urban fabrics.",
    "img":"/assets/exhibition/unknowablesmap_web.jpg",
    "year":"2018",
    "hasVideo": false,
    "blogItems": [
      {"imgUrl":"/assets/exhibition/p14_1.jpg"},
      {"imgUrl":"/assets/exhibition/p14_2.jpg"}
      ]
    }
    
 ]
}